<template>
	<aside class="sidebar">
		<div class="sidebar__head">
			<UserPreview v-if="userInfo" :avatar="avatar" :name="`${userInfo.family_name} ${userInfo.given_name}`" />
		</div>

		<div class="sidebar__section">
			<LeftMenu class="sidebar__menu">
				<LeftMenuItem v-for="item in items" :key="item.title" :icon="item.icon" :active="item.active">{{ item.title }}</LeftMenuItem>
			</LeftMenu>
		</div>

		<div v-for="category in categories" :key="category.id" class="sidebar__section">
			<div class="sidebar__section-title">{{ category.title }}</div>

			<TheSidebarResource
				v-for="resource in childs(category.id)"
				:key="resource.link"
				:img="resource.img"
				:text="resource.title"
				:link="resource.link"
				class="sidebar__resource"
			/>
		</div>

		<button @click="logout" class="sidebar__logout">Выйти из системы</button>
	</aside>
</template>

<script>
import UserPreview from '../UserPreview/UserPreview';
import avatar from '../../assets/img/avatar-default.png';
import LeftMenu from "../LeftMenu/LeftMenu";
import LeftMenuItem from "../LeftMenu/LeftMenuItem/LeftMenuItem";
import TheSidebarResource from "./TheSidebarResource/TheSidebarResource";
import { mapActions, mapGetters } from 'vuex';

import resource1 from '../../assets/img/resource-1.png';

export default {
	name: "TheSidebar",
	components: {TheSidebarResource, LeftMenuItem, LeftMenu, UserPreview},

	data: () => ({
		avatar,
		items: [
			{ title: 'Лента упоминаний', active: true, icon: '<svg width="16" height="16" viewBox="0 0 16 16" " xmlns="http://www.w3.org/2000/svg">\n' +
					'<path d="M0.5 2.16667V13.8333C0.5 14.75 1.24167 15.5 2.16667 15.5H7.16667V0.5H2.16667C1.24167 0.5 0.5 1.25 0.5 2.16667ZM5.5 13.8333H2.16667V2.16667H5.5V13.8333Z" fill="inherit"/>\n' +
					'<path d="M13.8333 0.5H8.83331V7.16667H15.5V2.16667C15.5 1.25 14.75 0.5 13.8333 0.5ZM13.8333 5.5H10.5V2.16667H13.8333V5.5Z" fill="inherit"/>\n' +
					'<path d="M8.83331 15.5H13.8333C14.75 15.5 15.5 14.75 15.5 13.8333V8.83333H8.83331V15.5ZM10.5 10.5H13.8333V13.8333H10.5V10.5Z" fill="inherit"/>\n' +
					'</svg>\n' },
			{ title: 'Хронология жизни', icon: '<svg width="20" height="18" viewBox="0 0 20 18" xmlns="http://www.w3.org/2000/svg">\n' +
					'<path d="M11.4286 0C6.69524 0 2.85714 3.8381 2.85714 8.57143H0L3.70476 12.2762L3.77143 12.4095L7.61905 8.57143H4.7619C4.7619 4.88571 7.74286 1.90476 11.4286 1.90476C15.1143 1.90476 18.0952 4.88571 18.0952 8.57143C18.0952 12.2571 15.1143 15.2381 11.4286 15.2381C9.59048 15.2381 7.92381 14.4857 6.72381 13.2762L5.37143 14.6286C6.92381 16.181 9.05714 17.1429 11.4286 17.1429C16.1619 17.1429 20 13.3048 20 8.57143C20 3.8381 16.1619 0 11.4286 0ZM10.4762 4.7619V9.52381L14.5238 11.9238L15.2571 10.7048L11.9048 8.71428V4.7619H10.4762Z" fill="inherit"/>\n' +
					'</svg>\n' },
			{ title: 'Аналитика', icon: '<svg width="20" height="11" viewBox="0 0 20 11" xmlns="http://www.w3.org/2000/svg">\n' +
					'<path d="M20 1.81818C20 2.81818 19.1818 3.63636 18.1818 3.63636C18.0182 3.63636 17.8636 3.61818 17.7182 3.57273L14.4818 6.8C14.5273 6.94545 14.5455 7.10909 14.5455 7.27273C14.5455 8.27273 13.7273 9.09091 12.7273 9.09091C11.7273 9.09091 10.9091 8.27273 10.9091 7.27273C10.9091 7.10909 10.9273 6.94545 10.9727 6.8L8.65455 4.48182C8.50909 4.52727 8.34546 4.54545 8.18182 4.54545C8.01818 4.54545 7.85455 4.52727 7.70909 4.48182L3.57273 8.62727C3.61818 8.77273 3.63636 8.92727 3.63636 9.09091C3.63636 10.0909 2.81818 10.9091 1.81818 10.9091C0.818182 10.9091 0 10.0909 0 9.09091C0 8.09091 0.818182 7.27273 1.81818 7.27273C1.98182 7.27273 2.13636 7.29091 2.28182 7.33636L6.42727 3.2C6.38182 3.05455 6.36364 2.89091 6.36364 2.72727C6.36364 1.72727 7.18182 0.909091 8.18182 0.909091C9.18182 0.909091 10 1.72727 10 2.72727C10 2.89091 9.98182 3.05455 9.93636 3.2L12.2545 5.51818C12.4 5.47273 12.5636 5.45455 12.7273 5.45455C12.8909 5.45455 13.0545 5.47273 13.2 5.51818L16.4273 2.28182C16.3818 2.13636 16.3636 1.98182 16.3636 1.81818C16.3636 0.818182 17.1818 0 18.1818 0C19.1818 0 20 0.818182 20 1.81818Z" fill="inherit"/>\n' +
					'</svg>\n' },
			{ title: 'Настройка', icon: '<svg width="18" height="18" viewBox="0 0 18 18" xmlns="http://www.w3.org/2000/svg">\n' +
					'<path d="M15.4434 9.882C15.4794 9.594 15.5064 9.306 15.5064 9C15.5064 8.694 15.4794 8.406 15.4434 8.118L17.3424 6.633C17.5134 6.498 17.5584 6.255 17.4504 6.057L15.6504 2.943C15.5694 2.799 15.4164 2.718 15.2544 2.718C15.2004 2.718 15.1464 2.727 15.1014 2.745L12.8604 3.645C12.3924 3.285 11.8884 2.988 11.3394 2.763L10.9974 0.378C10.9704 0.162 10.7814 0 10.5564 0H6.9564C6.7314 0 6.5424 0.162 6.5154 0.378L6.1734 2.763C5.6244 2.988 5.1204 3.294 4.6524 3.645L2.4114 2.745C2.3574 2.727 2.3034 2.718 2.2494 2.718C2.0964 2.718 1.9434 2.799 1.8624 2.943L0.0623984 6.057C-0.0546016 6.255 -0.000601472 6.498 0.170399 6.633L2.0694 8.118C2.0334 8.406 2.0064 8.703 2.0064 9C2.0064 9.297 2.0334 9.594 2.0694 9.882L0.170399 11.367C-0.000601472 11.502 -0.0456016 11.745 0.0623984 11.943L1.8624 15.057C1.9434 15.201 2.0964 15.282 2.2584 15.282C2.3124 15.282 2.3664 15.273 2.4114 15.255L4.6524 14.355C5.1204 14.715 5.6244 15.012 6.1734 15.237L6.5154 17.622C6.5424 17.838 6.7314 18 6.9564 18H10.5564C10.7814 18 10.9704 17.838 10.9974 17.622L11.3394 15.237C11.8884 15.012 12.3924 14.706 12.8604 14.355L15.1014 15.255C15.1554 15.273 15.2094 15.282 15.2634 15.282C15.4164 15.282 15.5694 15.201 15.6504 15.057L17.4504 11.943C17.5584 11.745 17.5134 11.502 17.3424 11.367L15.4434 9.882ZM13.6614 8.343C13.6974 8.622 13.7064 8.811 13.7064 9C13.7064 9.189 13.6884 9.387 13.6614 9.657L13.5354 10.674L14.3364 11.304L15.3084 12.06L14.6784 13.149L13.5354 12.69L12.5994 12.312L11.7894 12.924C11.4024 13.212 11.0334 13.428 10.6644 13.581L9.7104 13.968L9.5664 14.985L9.3864 16.2H8.1264L7.9554 14.985L7.8114 13.968L6.8574 13.581C6.4704 13.419 6.1104 13.212 5.7504 12.942L4.9314 12.312L3.9774 12.699L2.8344 13.158L2.2044 12.069L3.1764 11.313L3.9774 10.683L3.8514 9.666C3.8244 9.387 3.8064 9.18 3.8064 9C3.8064 8.82 3.8244 8.613 3.8514 8.343L3.9774 7.326L3.1764 6.696L2.2044 5.94L2.8344 4.851L3.9774 5.31L4.9134 5.688L5.7234 5.076C6.1104 4.788 6.4794 4.572 6.8484 4.419L7.8024 4.032L7.9464 3.015L8.1264 1.8H9.3774L9.5484 3.015L9.6924 4.032L10.6464 4.419C11.0334 4.581 11.3934 4.788 11.7534 5.058L12.5724 5.688L13.5264 5.301L14.6694 4.842L15.2994 5.931L14.3364 6.696L13.5354 7.326L13.6614 8.343ZM8.7564 5.4C6.7674 5.4 5.1564 7.011 5.1564 9C5.1564 10.989 6.7674 12.6 8.7564 12.6C10.7454 12.6 12.3564 10.989 12.3564 9C12.3564 7.011 10.7454 5.4 8.7564 5.4ZM8.7564 10.8C7.7664 10.8 6.9564 9.99 6.9564 9C6.9564 8.01 7.7664 7.2 8.7564 7.2C9.7464 7.2 10.5564 8.01 10.5564 9C10.5564 9.99 9.7464 10.8 8.7564 10.8Z" fill="inherit"/>\n' +
					'</svg>\n' },
		],

		categories: [
			{id: 1, title: 'Государство и право'},
			{id: 2, title: 'Карьера'},
			// {id: 3, title: 'Семья и отношения'},
			// {id: 4, title: 'Государство и право'},
		],

		resources: [
			{
				category: 1,
				title: 'Налог на имущество физических лиц в размере 199 руб. ',
				link: 'https://fssp.gov.ru',
				img: resource1,
			},

			{
				category: 2,
				title: 'Дизайнер-интерфейсов',
				link: 'https://freelance.ru',
				img: resource1,
			},

			{
				category: 2,
				title: 'РТ МИС • Medtech • Вакансии в IT',
				link: 'https://vk.com/ksx_ampi',
				img: resource1,
			},
		],
	}),

	computed: {
		...mapGetters(['userInfo']),
		childs() {
			return category =>
				this.resources.filter(item => item.category === category);
		},
	},

	methods: {
		...mapActions(['logout']),
	},
}
</script>

<style scoped lang="scss" src="./TheSidebar.scss"></style>
